test/setup_pressureVelocityCoupling_graded/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      ofU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.0 1.0 1.0);

boundaryField
{
    fixedWalls
    {
        type            noSlip;
        // type               noSlip;
        // type            fixedValue;
        // value           uniform (1.0 0.0 0.0); // note 1.0 is interpreted as an int
    }

    outlet
    {
        type            zeroGradient;
        // type               noSlip;
        // type            fixedValue;
        // value           uniform (1.0 0.0 0.0); // note 1.0 is interpreted as an int
    }

    inlet
    {
        type            fixedValue;
        value           uniform (1.0 0.0 0.0); // note 1.0 is interpreted as an int
    }

}


// ************************************************************************* //
