test/setup_pressureVelocityCoupling_graded/system/simulationParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          simulationParameters;
}

NX              3;

GRADSCHEME      Gauss linear;

DIVSCHEME       Gauss upwind;

LAPSCHEME       Gauss linear uncorrected;


// ************************************************************************* //
